[
  {
    "model": "blog.blog",
    "pk": 7,
    "fields": {
      "title": "Представлен Hackberry-Pi_Zero — карманный Linux на базе Raspberry Pi Zero 2W с 4\" TFT, клавиатурой BlackBerry и 2хBL-5C",
      "content": "Разработчик и студент Дрезденского технического университета под ником ZitaoTech представил открытый проект Hackberry-Pi_Zero, включая 3D-модель корпуса и электрическую схему под лицензией MIT. Это карманный терминал Linux на базе микрокомпьютера Raspberry Pi Zero 2W (чип Broadcom BCM2710A1 с четырьмя ядрами Cortex-A53 с рабочей частотой 1 ГГц, объём памяти 512 МБ ОЗУ LPDDR2 SDRAM) с 4\" TFT-дисплеем разрешением 720х720 пикселей, оригинальной клавиатурой BlackBerry (модель Q10 или Q20) и питающийся от двух стандартных АКБ типа Nokia BL-5C.\r\n\r\nДвойную сменную батарею можно поочерёдно заменить за 10 секунд, не отключая питание. Время работы батареи в режиме тестирования: 3,5 часа при использовании в качестве настольного компьютера, 5 часов в режиме работы в командной строке.\r\n\r\n«Основная причина, по которой я спроектировал и построил этот портативный Cyberdeck, заключается в том, что я хотел рассматривать его как инструмент обучения, а также забавную игрушку для хакеров», — уточнил ZitaoTech.\r\n\r\nHackberry-Pi_Zero имеет 3 порта USB2.0, его можно использовать с USB-накопителем или модулем 4G Dongle или любым USB-устройством. У КПК полностью настраиваемая раскладка клавиатуры: вы можете подключить клавиатуру к компьютеру и легко настроить раскладку клавиатуры через VIAL. КПК можно полностью зарядить за три часа (рассчитан на зарядный ток 1 А). Устройство имеет встроенный порт Stemma I2C, куда можно подключать любые датчики I2C. Гаджет имеет внешний слот для карты памяти типа TF.",
      "image": "blog/images/1.jpeg",
      "count_views": 1,
      "created_at": "2024-08-03T13:59:06.040Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 8,
    "fields": {
      "title": "Разблокировка iPhone сердцем, эпидемия утечек данных и обида Amazon на Nokia: дайджест главных новостей",
      "content": "Автомобили Ford сообщат в ДПС о превышении скорости, у Макбука может быть разворачивающийся экран с задней камерой, а конкурент Qrator Labs может лишиться патента, который хотел им лицензировать. Все главные новости в сфере интеллектуальной собственности за неделю в нашем материале. \r\n\r\nНа Россию приходится десятая часть продающихся в даркнете баз данных; хакеры готовы отдавать их бесплатно\r\n\r\nВ Positive Technologies подсчитали, что Россия оказалась лидером по украденным у компаний базам с личными данными пользователей, которые продаются в теневом интернете. На данные наших сограждан приходится 10% соответствующих объявлений. У США 8%, у Китая 6%. \r\n\r\nБазы содержат не только паспортные сведения, пароли, телефоны и адреса, но и данные, составляющие коммерческую тайну. \r\n\r\nF.A.C.C.T. (бывшая Group IB) рассказала прессе, что за первую половину 2024 года в сеть утекли 150 баз данных российских компаний на 200,5 млн строк. Около 30% принадлежат бизнесам в области розничной онлайн-торговли. \r\n\r\n\r\nПо данным Solar AURA, за весь 2023 год было зафиксировано 420 утечек, а за первые 2,5 месяца 2024 года  — уже 170.\r\n\r\nТакая тенденция объясняется беспрецедентным числом атак, обусловленных «нефинансовой мотивацией», отметил консультант по безопасности Positive Technologies Алексей Лукацкий. «Именно это и выводит нашу страну в лидеры не самого лучшего рейтинга», — уверен он. По данным компании, авторы 88% объявлений с утечками из российских компаний готовы передать базы бесплатно.\r\n\r\nApple превратит дисплей макбука в фотоаппарат? \r\n\r\nНа этой неделе Apple получила патент, в котором описывается набор вариантов реализации задней (внешней) камеры на дисплее фирменного ноутбука, при этом сам дисплей может быть вращающимся или съемным. \r\n\r\nКамеры могут быть съемными или встроенными, интегрированными в заднюю крышку монитора или выступающими над ней. Камера может быть снабжена комплектом сенсоров: лидаром, распознаванием лиц, распознаванием объектов, модулем инфракрасной съемки, видеокамерой дальностного изображения (time-of-flight).\r\n\r\nОписан также вариант реализации с отдельным процессором для камер, объединяющим внешнюю и внутреннюю камеры. \r\n\r\nAmazon подал патентный «иск мести» к Nokia\r\n\r\nAmazon обвиняет финскую компанию в нарушении патентов, связанных с облачными технологиями. А именно: \r\n\r\nС инфраструктурой виртуальных сетей: управлением коммуникациями и эмуляцией физических устройств;\r\n\r\nС безопасностью виртуальных сетей, предоставлением безопасного удалённого доступа;\r\n\r\nС производительностью виртуальных сетей, масштабированием, эффективной эксплуатацией и поддержкой;\r\n\r\nС распределённым исполнением и управлением ПО: бессерверные вычисления для динамического масштабирования, распределения и управления ресурсами в виртуальных и физических средах. \r\n\r\nИнтересно, что в тексте иска Amazon прошёлся по истории и перспективам бизнеса ответчика и пнул Nokia за упущение зарождавшегося рынка смартфонов и проигрыш на нём. Неспособность понять перспективы смартфонов привела Nokia на грань банкротства в 2013 году, рассказывает Amazon суду. \r\n\r\nЧтобы спасти компанию, её руководство в 2014 объявило пивот в направлении технологий и инфраструктуры связи 5G. Также Nokia сделала ставку на облачные вычисления, но получилось это только благодаря использованию инновационных разработок и запатентованных решений Amazon. \r\n\r\nПравда, в 2014 ни о каких сетях 5G и речи не было, они начали внедряться в 2019. С другой стороны, инфраструктурой мобильных сетей в Nokia начали заниматься уже в 2013, купив Siemens Networks. А в 2023 года Nokia заключила партнёрство с принадлежащей IBM Red Hat и начала отдавать ей свои облачные сервисы вместе с пользователями. \r\n\r\nНаконец, иск несколько смущает наблюдателей тем, что Amazon Web Services и Nokia выступают как партнёры в обслуживании некоторых крупных клиентов. Отраслевая пресса считает, что иск Amazon является ответом на поданный против него в 2023 году иск Nokia. Предметом того иска стало нарушение видеосервисами Amazon (Prime Video и стриминг) патентов финской корпорации на технологии сжатия видео, доставки контента, рекомендаций видео и «аспекты, относящиеся к оборудованию».\r\n\r\nЛицензирование патентов является сейчас для Nokia одним из важных источников прибыли, компания активно работает над защитой и монетизацией своей интеллектуальной собственности. Возможно, Amazon выдвинул встречный иск, чтобы в итоге взаимно аннигилировать претензии. И выгоду от разбирательств, как обычно, получат только адвокаты, а компании договорятся, ничего существенно не приобретя и не потеряв.  \r\n\r\nApple запатентовала биометрию по сердцебиению, которую разрабатывала с 2008 года\r\n\r\nВ новом патенте описывается система разблокировки iPhone с помощью идентификации пользователя по сердечному ритму (Heart ID). Для распознавания могут использоваться разные аспекты сердцебиения: длительность участков с определённым ритмом, относительный размер пиков на электрокардиограмме, те или иные характерные амплитуды. \r\n\r\nПроблема, на которой концентрируются описанные в патенте решения, сводится к необходимости для пользователя коснуться сразу двух электрических контактов для снятия кардиограммы. Производителю придётся расположить где-то на устройстве эти контакты, что может сделать недостаточно эстетичным его дизайн, а пользователю надо будет и прикасаться к контактам, и производить ещё какое-то действие для разблокировки телефона, например, сдвигать слайдер на экране. Пользователям будет неудобно со всем этим возиться, и они просто отключат биометрическую идентификацию. \r\n\r\nПредлагаемые Apple варианты: кардиосенсоры интегрированы в устройство так, что пользователь постоянно контактирует с ними (колумнист Patently Apple нашёл тут намёк на реализацию сердечной биометрии в Apple Watch); сенсоры интегрированы в отдельное или подсоединённое устройство, которое пользователь может держать в руке; сенсоры интегрированы в корпус устройства. \r\n\r\nДалее в тексте патента компания рассматривает разные способы размещения выводов электрических контактов, при которых не пострадает эстетика гаджета и будет обеспечена изоляция между контактами для предотвращения помех и коротких замыканий. \r\n\r\nВ тексте охранного документа отмечается, что патентная заявка является продолжением заявки от 2018 года, которая в свою очередь является продолжением заявки от 2013 года, которая является продолжением заявки от 2009 года, которая устанавливает приоритет заявки от 2008 года. Вот такая длинная история.\r\n\r\nFord научит машины доносить друг на друга за превышение скорости\r\n\r\nАвтопроизводитель патентует систему, которая определяет скорость других машин на трассе, обнаруживая превышение, фотографирует машину нарушителя и сообщает о нём в полицию. Передаётся фото, геолокация по GPS и сведения о скорости на момент фиксации. \r\n\r\nПравда, непонятно, какой правовой статус будут иметь эти сообщения и подтверждающая их информация, так как по закону нарушение должен фиксировать сотрудник полиции. Уличные камеры дорожного контроля автоматически выписывают штрафы на основе распознавания номеров машины, так что аналогий с их легальным статусом быть не может. \r\n\r\nWestern Digital заплатит $262 млн за два патента\r\n\r\n\r\nИзвестный производитель жёстких дисков и других устройств хранения информации проиграл в суде с австрийским физиком Дитером Зюссом, который обвинил компанию в нарушении двух своих патентов. Эти документы описывали технологии, увеличивающие ёмкость жёстких дисков. \r\n\r\nТеперь Western Digital должна истцу $262,3 млн компенсации, но компания собирается подавать апелляцию. Она считает, что адвокаты Зюсса сильно преувеличивают его достижения, заявляя, что его изобретение стало прорывом в технологиях магнитной записи, и что Western Digital без использования его разработок не смогла бы конкурировать на рынке.  \r\n\r\nИБ-гигант собрался лишить патента мелкого конкурента\r\n\r\nОдин из лидеров российского рынка кибербезопасности Qrator Labs оспаривает патент небольшой компании Andmaxlab, которая уже лицензирует технологию другим разработчикам средств анализа интернет-трафика. Заключить лицензионный договор стартап предложил и Qrator Labs, не предъявляя никаких претензий. \r\n\r\nПоследние подали в Палату по патентным спорам заявление об аннулировании патента «Способ диагностики маршрутов трафика заданных информационных ресурсов в сети Интернет», выданного в 2023 году на имя гендиректора Andmaxlab Андрея Кобцева. \r\n\r\nAndmaxlab «предлагает программные средства для сбора данных о топологии сети (bgp-watcher) и выявления аномалий маршрутизации трафика (bgp-siem)». Аналогичные функции имеет платформа Qrator.Radar. \r\n\r\nВ Qrator Labs считают, что изобретение Andmaxlab не обладает технической новизной — а это один из трёх критериев патентоспособности. «Патентная формула основывается на технических решениях, известных и используемых в отрасли задолго до выдачи патента», утверждает гендиректор компании. \r\n\r\nЗаседание Коллегии Палаты по патентным спорам должно было состояться 29 июля, но было перенесено на сентябрь из-за неявки представителя Andmaxlab. \r\n\r\nООО «Андмакс» основано в 2022 году, чистая прибыль компании в 2023 году составила 2,9 млн руб. при выручке 9,5 млн руб. Чистая прибыль ООО «Эйч-эль-эль» (юрлицо Qrator Labs) за тот же период — 344 млн руб., выручка — 1,5 млрд руб.",
      "image": "",
      "count_views": 0,
      "created_at": "2024-08-03T14:02:23.592Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 9,
    "fields": {
      "title": "В Индонезии заблокировали DuckDuckGo из-за порнографического и игорного контента в поисковой выдаче",
      "content": "Жители Индонезии пожаловались на порнографический и игорный контент в поисковой выдаче DuckDuckGo. Первое нарушение неприемлемо в мусульманской стране, а второе — запрещено на законодательном уровне. В итоге поисковую систему, ориентированную на конфиденциальность, заблокировал регулятор Индонезии, доступ к DuckDuckGo через операторов связи на всей территории страны закрыт без использования VPN.\r\n\r\nРешение правительства Индонезии заблокировать DuckDuckGo неудивительно, учитывая культурный и религиозный контекст. Индонезия является мусульманской страной, где азартные игры запрещены, а порно считается морально неприемлемым.\r\n\r\nВ январе 2024 года Индонезия объявила о блокировке почти 600 тыс. порталов азартных игр и приняла меры в отношении 5 тыс. банковских счетов, которые с ними взаимодействовали.\r\n\r\nРанее правительство заблокировало множество порносайтов, платформы Reddit и Vimeo, а также ввело временные или частичные ограничения на Tumblr, Telegram, TikTok, Netflix и Badoo.\r\n\r\nDuckDuckGo подтвердил BleepingComputer, что Индонезия заблокировала поисковую систему в стране и что у компании нет возможности отреагировать на это.\r\n\r\n«Мы можем подтвердить, что DuckDuckGo был заблокирован в Индонезии из-за их политики цензуры. К сожалению, на данный момент нет способа разблокировать наш проект, подобно тому, как нас блокируют в Китае уже около десяти лет», — уточнили в DuckDuckGo.\r\n\r\nПримечательно, что поиск Google Search остаётся доступным в Индонезии, что говорит о том, что либо технологический гигант внедрил эффективные механизмы самоцензуры для своей локальной поисковой системы, либо его размер делает блокировку слишком разрушительной для использования Интернета в стране.\r\n\r\nВ рамках блокировки DuckDuckGo индонезийцы прибегли к использованию VPN-сервисов, чтобы обойти ограничения правительства. Однако в Индонезии планируется заблокировать бесплатные VPN, что сделает получение доступа к заблокированным ресурсам дорогостоящей опцией.\r\n\r\nМинистр связи и информации Индонезии Буди Арие Сетиади заявил, что правительство намерено ограничить доступ к бесплатным инструментам VPN, поскольку эти ресурсы используются для доступа к заблокированным порталам онлайн-гемблинга.\r\n\r\n«Ведомство решает вопрос об онлайн-гемблинге, чтобы ясно дать понять, что это самая тёмная сторона цифровизации», — уточнил Сетиади. Также министр напомнил риски бесплатных VPN-сервисов, в частности кража персональных данных, заражение вредоносным ПО и замедление или ненадёжность интернет-соединения.",
      "image": "blog/images/2.jpeg",
      "count_views": 1,
      "created_at": "2024-08-03T14:03:21.138Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 10,
    "fields": {
      "title": "Microsoft выпустила обновление KB5001716 для Windows 10/11 с предупреждением о необходимости обновить ОС или ПК",
      "content": "В конце июля 2024 года Microsoft выпустила сервисное обновление KB5001716 для компонентов службы Центра обновления Windows 10 (2004, 20H2, 21H1, 21H2, 22H2) и Windows 11 (21H2) ради предупреждения пользователей о необходимости обновить ОС до текущей версии Windows 11 или задуматься об обновлении ПК для поддержки новых возможностей Windows.\r\n\r\nВыпуск KB5001716 отличается от обычных улучшений и патчей безопасности, поскольку он обновляет компоненты службы Центра обновления Windows. По сути, это означает, что Windows автоматически загружает и устанавливает более новое обновление функций Windows 10 или 11 в случае, если текущая версия ОС на ПК приближается к концу статуса обслуживания или этот момент уже произошёл ранее. Также обновление KB5001716 включает в себя новую функциональность пользовательского интерфейса (UI) для Центра обновления Windows.\r\n\r\nПосле установки обновления KB5001716 Windows 10/11 может попытаться загрузить и установить обновления ОС, если поддержка текущей установленной версии Windows приближается или уже завершилась. В Microsoft пояснили, что обновление ОС до текущей поддерживаемой версии предлагает новые функции и помогает обеспечить безопасность ПК пользователя.\r\n\r\nПосле установки обновления KB5001716 Windows 10/11 может периодически отображать уведомление о проблемах, которые могут помешать Центру обновления Windows поддерживать ПК пользователя в актуальном состоянии и защищать его от текущих угроз. Например, может появится уведомление о том, что на ПК в настоящее время установлена ​​версия Windows, срок поддержки которой подошел к концу, или что ПК не соответствует минимальным требованиям к оборудованию для текущей установленной версии Windows или последним версиям 24H1/24H2.\r\n\r\nВ Microsoft пояснили, что уведомления после установки KB5001716 будет действовать в следующих режимах работы Windows: полноэкранный режим, игра, тихий час и помощь с фокусировкой (full screen, game, quiet time and focus assist).",
      "image": "blog/images/3.png",
      "count_views": 0,
      "created_at": "2024-08-03T14:04:18.459Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 11,
    "fields": {
      "title": "Депутат Диденко сообщил, что в России будут заблокированы Google, Android и IOS",
      "content": "В скором времени в России будет заблокирован не только YouTube, но и Google, Android и IOS. Об этом в пятницу, 2 августа, сообщил депутат Государственной думы Алексей Диденко.\r\n\r\n— Госслужащим давно запрещено пользоваться этими платформами, особенно тем, кто имеет доступ к конфиденциальной информации. Это был первый намек на то, что вам нужно перейти на другие платформы. Мы рекомендуем сделать это представителям бизнеса и ученым, — высказался Диденко.\r\n\r\n«Скоро Google будет заблокирован, а вместе с ним и Google Android. Также будет заблокирован iOS, и это произойдет не по нашей инициативе», — отметил депутат.\r\n\r\nОн также подчеркнул, что вопрос выживания российских систем и суверенитета — это вопрос существования.",
      "image": "blog/images/4.jpg",
      "count_views": 0,
      "created_at": "2024-08-03T14:05:12.079Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 12,
    "fields": {
      "title": "В России разработали наноразмерный источник фотонов для оптоэлектронных чипов",
      "content": "Никита Соломонов, ученый из Алферовского университета и член консорциума Центра компетенций НТИ «Фотоника», создал наноразмерный источник оптического излучения на чипе для фотонных интегральных схем (ФИС). Этот источник управляется внешним электрическим сигналом и генерирует фотоны на наноуровне. \r\n\r\nГлавная особенность источника заключается в возможности установки на чип вблизи волновода, что существенно увеличивает скорость передачи данных, отмечают в НТИ «Фотоника». Технологию предлагается применять в производстве компонентов для оптоэлектроники и квантовых технологий.\r\n\r\n«Наш проект посвящен созданию и исследованию сверхкомпактных источников оптического излучения на основе туннельного контакта с массивом наноантенн в тонких слоях золота. Обнаружено, что внедрение таких наноструктур увеличивает внешнюю квантовую эффективность более чем в 10 раз, что открывает новые перспективы для применения в оптоэлектронике и квантовых технологиях», — рассказывает автор разработки.\r\n\r\nПо словам Соломонова, предыдущие попытки внедрения подобных источников в массовое производство были ограничены низкой квантовой эффективностью, когда из десятков миллионов туннелирующих электронов генерировался всего один фотон, что не давало необходимого уровня сигнала. Новый метод, включающий использование наноантенн, напечатанных фемтосекундными лазерными импульсами на золотой плёнке, совместим с промышленным производством и существенно повышает эффективность излучения.\r\n\r\nОсновная цель разработки заключается в создании источника излучения, который можно локализовать близко к волноводам для повышения производительности ФИС.  \r\n\r\nПредлагаемые источники обладают перестраиваемой длиной волны без использования модуляторов. Достаточно реализовать массив наноантенн и подключить туннельные контакты размером 1-2 нанометра, что значительно тоньше человеческого волоса, чтобы на этом этапе можно было перестраивать длину излучения для быстрой передачи информации. \r\n\r\nТакой подход позволяет размещать большее количество источников на ограниченной площади, что увеличивает производительность и функциональность по сравнению с традиционными источниками оптического излучения. Это открывает новые перспективы в развитии фотонных и телекоммуникационных технологий.",
      "image": "",
      "count_views": 0,
      "created_at": "2024-08-03T14:05:42.395Z"
    }
  },
  {
    "model": "blog.blog",
    "pk": 13,
    "fields": {
      "title": "Apple патентует распознавание жестов Vision Pro на iPhone, iPad и Mac",
      "content": "Apple зарегистрировала патент, предполагающий использование жестов, предназначенных для Vision Pro, с другими устройствами. iPhone и iPad могут распознавать жесты системами Face ID, а для Mac предусмотрено выполнение жестов на увеличенном трекпаде. \r\n\r\nКак отмечает Apple Insider, существенная часть заявки посвящена тому, как Vision Pro распознаёт жесты. Большое внимание уделяется шагам, необходимым для правильного распознавания жеста и отклонения ложных срабатываний, например, если пользователь почесал нос. Для этого устройство будет определять, соответствует ли движение руки «набору критериев» (например, может ли оно привести к изменению положения курсора). Если система определяет, что жест не соответствует набору критериев, жест игнорируется.\\\r\nВ феврале Apple запатентовала специальные датчики на руки, которые позволят прикасаться к предметам в дополненной и виртуальной реальности, а также получать обратную связь в виде ощущений.\r\n\r\nВ июле стало известно, что компания получила патент на датчики мозговых волн для гарнитуры Vision Pro, который призваны улучшать психическое здоровье, помогать в тренировках и повышать внимательность.\r\n\r\nТакже Apple разрабатывает технологию для носимых устройств, включая гарнитуру смешанной реальности Vision Pro, которая измеряет и отслеживает биометрические данные и местоположение для предоставления жизненно важных медицинских консультаций. Устройства будут способны обнаружить, что пользователь забыл принять лекарство, и направить его к рецептурным препаратам. Аналогичным образом гаджет сможет определить уровень обезвоженности и предложить пользователю выпить воды.",
      "image": "blog/images/5.jpg",
      "count_views": 0,
      "created_at": "2024-08-03T14:06:40.529Z"
    }
  }
]
